app/Http/Controllers/DashboardController.php

    public function dashboard(){

        $ideas = Idea::orderBy('created_at','desc');

        if(request()->has("search")){
            $ideas = $ideas->where('content','like', '%' . request()->get('search','') .'%');
        }

        return view('dashboard', [
            'ideas' => $ideas ->paginate(3), //paginate for pagination show 3 data
        ]);
---
select count(*) as aggregate from `ideas`