app/Http/Controllers/IdeaController.php

insert into `ideas` (`content`, `user_id`, `updated_at`, `created_at`) values ('dasdasdasdasdasdasdasda', 1, '2024-04-27 04:27:44', '2024-04-27 04:27:44')
---
    public function store(CreateIdeaRequest $request){

        $validated = $request->validated();

        $validated['user_id'] = auth()->id();

        Idea::create($validated);