app/Http/Controllers/UserController.php

    public function show(User $user)
    {
        $ideas = $user->ideas()->paginate(3);
---
select count(*) as aggregate from `ideas` where `ideas`.`user_id` = 4 and `ideas`.`user_id` is not null

    public function edit(User $user)
    {
        $this->authorize("update", $user);

        $editing = true;
        $ideas = $user->ideas()->paginate(3);
---
select count(*) as aggregate from `ideas` where `ideas`.`user_id` = 6 and `ideas`.`user_id` is not null

    public function update(UpdateUserRequest $request, User $user)
    {
        $this->authorize("update", $user);

        $validated = $request->validated();

        if($request->has('image')){
            $imagePath = $request->file('image')->store('profile','public');
            $validated['image'] = $imagePath;

            Storage::disk('public')->delete($user->image ?? '');
        }


        $user->update($validated);
---
update `users` set `image` = 'profile/KEdCQcebcnyqhydNfJa7svVg66CZBDzBeS9f296a.jpg', `users`.`updated_at` = '2024-04-27 04:30:35' where `id` = 1